"""
Урок 2. Задание 5.

Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
У пользователя необходимо запрашивать новый элемент рейтинга.
Если в рейтинге существуют элементы с одинаковыми значениями,
то новый элемент с тем же значением должен разместиться после них.
Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].
"""

my_list = [7, 5, 3, 3, 2]


while True:
    user_num = input('Введите число:\n>')
    if user_num.isdigit():
        user_num = int(user_num)
        print(f'Исходный вид рейтинга: {my_list}')
        my_list.append(user_num)
        my_list.sort(reverse=True)
        print(f'Рейтинг после добавления вашего числа: {my_list}')
        tmp = input('Введите Yes, если хотите продолжить ввод данных. Для остановки - любую клавишу.')
        if tmp.lower() != "yes":
            break
    else:
        print('Ошибка ввода, это не число')

# print(f'Исходный вид рейтинга: {my_list}')
#
# my_list.append(user_num)
# my_list.sort(reverse = True)
# print(f'Рейтинг после добавления вашего числа: {my_list}')
